{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "user_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "user_id_inp"}, "inbound_nodes": []}, {"name": "product_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "product_id_inp"}, "inbound_nodes": []}, {"name": "order_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "order_id_inp"}, "inbound_nodes": []}, {"name": "aisle_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "aisle_id_inp"}, "inbound_nodes": []}, {"name": "department_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "department_id_inp"}, "inbound_nodes": []}, {"name": "user_orders_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_orders_in"}, "inbound_nodes": []}, {"name": "days_since_prior_order_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "days_since_prior_order_in"}, "inbound_nodes": []}, {"name": "up_orders_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_orders_in"}, "inbound_nodes": []}, {"name": "up_first_order_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_first_order_in"}, "inbound_nodes": []}, {"name": "up_last_order_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_last_order_in"}, "inbound_nodes": []}, {"name": "up_average_cart_position_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_average_cart_position_in"}, "inbound_nodes": []}, {"name": "prod_orders_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "prod_orders_in"}, "inbound_nodes": []}, {"name": "prod_reorder_probability_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "prod_reorder_probability_in"}, "inbound_nodes": []}, {"name": "prod_reorder_ratio_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "prod_reorder_ratio_in"}, "inbound_nodes": []}, {"name": "user_period_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_period_in"}, "inbound_nodes": []}, {"name": "user_distinct_products_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_distinct_products_in"}, "inbound_nodes": []}, {"name": "user_mean_days_since_prior_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_mean_days_since_prior_in"}, "inbound_nodes": []}, {"name": "user_total_products_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_total_products_in"}, "inbound_nodes": []}, {"name": "user_average_basket_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_average_basket_in"}, "inbound_nodes": []}, {"name": "up_order_rate_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_order_rate_in"}, "inbound_nodes": []}, {"name": "up_orders_since_last_order_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_orders_since_last_order_in"}, "inbound_nodes": []}, {"name": "embedding_6", "class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 198487, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["user_id_inp", 0, 0, {}]]]}, {"name": "embedding_7", "class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 41614, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["product_id_inp", 0, 0, {}]]]}, {"name": "embedding_8", "class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 198487, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["order_id_inp", 0, 0, {}]]]}, {"name": "embedding_9", "class_name": "Embedding", "config": {"name": "embedding_9", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 134, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["aisle_id_inp", 0, 0, {}]]]}, {"name": "embedding_10", "class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 21, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["department_id_inp", 0, 0, {}]]]}, {"name": "reshape_18", "class_name": "Reshape", "config": {"name": "reshape_18", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_orders_in", 0, 0, {}]]]}, {"name": "reshape_19", "class_name": "Reshape", "config": {"name": "reshape_19", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["days_since_prior_order_in", 0, 0, {}]]]}, {"name": "reshape_20", "class_name": "Reshape", "config": {"name": "reshape_20", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_orders_in", 0, 0, {}]]]}, {"name": "reshape_21", "class_name": "Reshape", "config": {"name": "reshape_21", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_first_order_in", 0, 0, {}]]]}, {"name": "reshape_22", "class_name": "Reshape", "config": {"name": "reshape_22", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_last_order_in", 0, 0, {}]]]}, {"name": "reshape_23", "class_name": "Reshape", "config": {"name": "reshape_23", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_average_cart_position_in", 0, 0, {}]]]}, {"name": "reshape_24", "class_name": "Reshape", "config": {"name": "reshape_24", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["prod_orders_in", 0, 0, {}]]]}, {"name": "reshape_25", "class_name": "Reshape", "config": {"name": "reshape_25", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["prod_reorder_probability_in", 0, 0, {}]]]}, {"name": "reshape_26", "class_name": "Reshape", "config": {"name": "reshape_26", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["prod_reorder_ratio_in", 0, 0, {}]]]}, {"name": "reshape_27", "class_name": "Reshape", "config": {"name": "reshape_27", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_period_in", 0, 0, {}]]]}, {"name": "reshape_28", "class_name": "Reshape", "config": {"name": "reshape_28", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_distinct_products_in", 0, 0, {}]]]}, {"name": "reshape_29", "class_name": "Reshape", "config": {"name": "reshape_29", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_mean_days_since_prior_in", 0, 0, {}]]]}, {"name": "reshape_30", "class_name": "Reshape", "config": {"name": "reshape_30", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_total_products_in", 0, 0, {}]]]}, {"name": "reshape_31", "class_name": "Reshape", "config": {"name": "reshape_31", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_average_basket_in", 0, 0, {}]]]}, {"name": "reshape_32", "class_name": "Reshape", "config": {"name": "reshape_32", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_order_rate_in", 0, 0, {}]]]}, {"name": "reshape_33", "class_name": "Reshape", "config": {"name": "reshape_33", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_orders_since_last_order_in", 0, 0, {}]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_6", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["embedding_7", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["embedding_8", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["embedding_9", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["embedding_10", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_18", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_19", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_20", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_21", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_22", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_23", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_24", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_25", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_26", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_27", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_28", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_29", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_30", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_31", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_32", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_33", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.009999999776482582, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}], "input_layers": [["user_id_inp", 0, 0], ["product_id_inp", 0, 0], ["order_id_inp", 0, 0], ["aisle_id_inp", 0, 0], ["department_id_inp", 0, 0], ["user_orders_in", 0, 0], ["days_since_prior_order_in", 0, 0], ["up_orders_in", 0, 0], ["up_first_order_in", 0, 0], ["up_last_order_in", 0, 0], ["up_average_cart_position_in", 0, 0], ["prod_orders_in", 0, 0], ["prod_reorder_probability_in", 0, 0], ["prod_reorder_ratio_in", 0, 0], ["user_period_in", 0, 0], ["user_distinct_products_in", 0, 0], ["user_mean_days_since_prior_in", 0, 0], ["user_total_products_in", 0, 0], ["user_average_basket_in", 0, 0], ["up_order_rate_in", 0, 0], ["up_orders_since_last_order_in", 0, 0]], "output_layers": [["dense_7", 0, 0]]}, "keras_version": "2.1.4", "backend": "tensorflow"}