{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "user_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "user_id_inp"}, "inbound_nodes": []}, {"name": "product_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "product_id_inp"}, "inbound_nodes": []}, {"name": "aisle_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "aisle_id_inp"}, "inbound_nodes": []}, {"name": "department_id_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "department_id_inp"}, "inbound_nodes": []}, {"name": "user_orders_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_orders_in"}, "inbound_nodes": []}, {"name": "days_since_prior_order_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "days_since_prior_order_in"}, "inbound_nodes": []}, {"name": "up_orders_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_orders_in"}, "inbound_nodes": []}, {"name": "up_first_order_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_first_order_in"}, "inbound_nodes": []}, {"name": "up_last_order_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_last_order_in"}, "inbound_nodes": []}, {"name": "up_average_cart_position_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_average_cart_position_in"}, "inbound_nodes": []}, {"name": "prod_orders_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "prod_orders_in"}, "inbound_nodes": []}, {"name": "user_period_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_period_in"}, "inbound_nodes": []}, {"name": "prod_reorder_ratio_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "prod_reorder_ratio_in"}, "inbound_nodes": []}, {"name": "prod_reorder_probability_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "prod_reorder_probability_in"}, "inbound_nodes": []}, {"name": "user_distinct_products_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_distinct_products_in"}, "inbound_nodes": []}, {"name": "user_mean_days_since_prior_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_mean_days_since_prior_in"}, "inbound_nodes": []}, {"name": "user_total_products_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_total_products_in"}, "inbound_nodes": []}, {"name": "user_average_basket_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "user_average_basket_in"}, "inbound_nodes": []}, {"name": "up_order_rate_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_order_rate_in"}, "inbound_nodes": []}, {"name": "up_orders_since_last_order_in", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "up_orders_since_last_order_in"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 129884, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["user_id_inp", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 42518, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["product_id_inp", 0, 0, {}]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 134, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["aisle_id_inp", 0, 0, {}]]]}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 21, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["department_id_inp", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_orders_in", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["days_since_prior_order_in", 0, 0, {}]]]}, {"name": "reshape_3", "class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_orders_in", 0, 0, {}]]]}, {"name": "reshape_4", "class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_first_order_in", 0, 0, {}]]]}, {"name": "reshape_5", "class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_last_order_in", 0, 0, {}]]]}, {"name": "reshape_6", "class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_average_cart_position_in", 0, 0, {}]]]}, {"name": "reshape_7", "class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["prod_orders_in", 0, 0, {}]]]}, {"name": "reshape_8", "class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_period_in", 0, 0, {}]]]}, {"name": "reshape_9", "class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["prod_reorder_ratio_in", 0, 0, {}]]]}, {"name": "reshape_10", "class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["prod_reorder_probability_in", 0, 0, {}]]]}, {"name": "reshape_11", "class_name": "Reshape", "config": {"name": "reshape_11", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_distinct_products_in", 0, 0, {}]]]}, {"name": "reshape_12", "class_name": "Reshape", "config": {"name": "reshape_12", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_mean_days_since_prior_in", 0, 0, {}]]]}, {"name": "reshape_13", "class_name": "Reshape", "config": {"name": "reshape_13", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_total_products_in", 0, 0, {}]]]}, {"name": "reshape_14", "class_name": "Reshape", "config": {"name": "reshape_14", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["user_average_basket_in", 0, 0, {}]]]}, {"name": "reshape_15", "class_name": "Reshape", "config": {"name": "reshape_15", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_order_rate_in", 0, 0, {}]]]}, {"name": "reshape_16", "class_name": "Reshape", "config": {"name": "reshape_16", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["up_orders_since_last_order_in", 0, 0, {}]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_1", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["embedding_2", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["embedding_3", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["embedding_4", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_1", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_2", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_3", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_4", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_5", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_6", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_7", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_8", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_9", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_10", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_11", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_12", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_13", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_14", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_15", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}], ["reshape_16", 0, 0, {"mask": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.009999999776482582, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "wide", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 51], "dtype": "float32", "sparse": false, "name": "wide"}, "inbound_nodes": []}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["wide", 0, 0, {}], ["dense_3", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "wide_deep", "class_name": "Dense", "config": {"name": "wide_deep", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["wide", 0, 0], ["user_id_inp", 0, 0], ["product_id_inp", 0, 0], ["aisle_id_inp", 0, 0], ["department_id_inp", 0, 0], ["user_orders_in", 0, 0], ["days_since_prior_order_in", 0, 0], ["up_orders_in", 0, 0], ["up_first_order_in", 0, 0], ["up_last_order_in", 0, 0], ["up_average_cart_position_in", 0, 0], ["prod_orders_in", 0, 0], ["user_period_in", 0, 0], ["prod_reorder_ratio_in", 0, 0], ["prod_reorder_probability_in", 0, 0], ["user_distinct_products_in", 0, 0], ["user_mean_days_since_prior_in", 0, 0], ["user_total_products_in", 0, 0], ["user_average_basket_in", 0, 0], ["up_order_rate_in", 0, 0], ["up_orders_since_last_order_in", 0, 0]], "output_layers": [["wide_deep", 0, 0]]}, "keras_version": "2.1.4", "backend": "tensorflow"}